MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334KATI/mcu.h
/**
 * @brief PLA
 */
typedef struct {
    __IO uint32_t GCTL;
    uint8_t RESERVED0[8];
    __I  uint32_t STAT;
    __IO uint32_t MUXS0;
    __IO uint32_t LUTCTL0;
    __IO uint32_t CTL0;
    __IO uint32_t MUXS1;
    __IO uint32_t LUTCTL1;
    __IO uint32_t CTL1;
    __IO uint32_t MUXS2;
    __IO uint32_t LUTCTL2;
    __IO uint32_t CTL2;
    __IO uint32_t MUXS3;
    __IO uint32_t LUTCTL3;
    __IO uint32_t CTL3;
    __IO uint32_t MUXS4;
    __IO uint32_t LUTCTL4;
    __IO uint32_t CTL4;
    __IO uint32_t MUXS5;
    __IO uint32_t LUTCTL5;
    __IO uint32_t CTL5;
    __IO uint32_t MUXS6;
    __IO uint32_t LUTCTL6;
    __IO uint32_t CTL6;
    __IO uint32_t MUXS7;
    __IO uint32_t LUTCTL7;
    __IO uint32_t CTL7;
    __IO uint32_t MUXS8;
    __IO uint32_t LUTCTL8;
    __IO uint32_t CTL8;
    __IO uint32_t MUXS9;
    __IO uint32_t LUTCTL9;
    __IO uint32_t CTL9;
    __IO uint32_t MUXS10;
    __IO uint32_t LUTCTL10;
    __IO uint32_t CTL10;
    __IO uint32_t MUXS11;
    __IO uint32_t LUTCTL11;
    __IO uint32_t CTL11;
    __IO uint32_t MUXS12;
    __IO uint32_t LUTCTL12;
    __IO uint32_t CTL12;
    __IO uint32_t MUXS13;
    __IO uint32_t LUTCTL13;
    __IO uint32_t CTL13;
    __IO uint32_t MUXS14;
    __IO uint32_t LUTCTL14;
    __IO uint32_t CTL14;
    __IO uint32_t MUXS15;
    __IO uint32_t LUTCTL15;
    __IO uint32_t CTL15;
} CM_PLA_TypeDef;

/**
 * @brief PWC
 */
typedef struct {
    __IO uint32_t FCG0;
    __IO uint32_t FCG1;
    __IO uint32_t FCG2;
    __IO uint32_t FCG3;
    __IO uint32_t FCG0PC;
    uint8_t RESERVED0[17388];
    __IO uint16_t WKTCR;
    uint8_t RESERVED1[2046];
    __IO uint8_t  PWRC0;
    uint8_t RESERVED2[3];
    __IO uint8_t  PWRC1;
    uint8_t RESERVED3[11];
    __IO uint8_t  PWRC4;
    uint8_t RESERVED4[3];
    __IO uint8_t  PVDCR0;
    uint8_t RESERVED5[3];
    __IO uint8_t  PVDCR1;
    uint8_t RESERVED6[3];
    __IO uint8_t  PVDFCR;
    uint8_t RESERVED7[3];
    __IO uint8_t  PVDLCR;
    uint8_t RESERVED8[7];
    __IO uint8_t  PDWKE0;
    uint8_t RESERVED9[3];
    __IO uint8_t  PDWKE1;
    uint8_t RESERVED10[3];
    __IO uint8_t  PDWKE2;
    uint8_t RESERVED11[3];
    __IO uint8_t  PDWKES;
    uint8_t RESERVED12[3];
    __IO uint8_t  PDWKF0;
    uint8_t RESERVED13[3];
    __IO uint8_t  PDWKF1;
    uint8_t RESERVED14[3];
    __IO uint8_t  PWRC5;
    uint8_t RESERVED15[3];
    __IO uint8_t  PWRC6;
    uint8_t RESERVED16[123];
    __IO uint8_t  PVDICR;
    uint8_t RESERVED17[3];
    __IO uint8_t  PVDDSR;
    uint8_t RESERVED18[3];
    __IO uint32_t RAMPC0;
    uint8_t RESERVED19[4];
    __IO uint32_t PRAMLPC;
    uint8_t RESERVED20[4];
    __I  uint16_t LPMCSR;
    __IO uint16_t LPMCSCR;
    uint8_t RESERVED21[29488];
    __IO uint16_t STPMCR;
    uint8_t RESERVED22[1008];
    __IO uint16_t FPRC;
} CM_PWC_TypeDef;

/**
 * @brief RMU
 */
typedef struct {
    __IO uint32_t FRST0;
    __IO uint32_t FRST1;
    __IO uint32_t FRST2;
    __IO uint32_t FRST3;
    __IO uint8_t  PRSTCR0;
    uint8_t RESERVED0[3];
    __IO uint32_t RSTF0;
} CM_RMU_TypeDef;

/**
 * @brief RTC
 */
typedef struct {
    __IO uint8_t  CR0;
    uint8_t RESERVED0[3];
    __IO uint8_t  CR1;
    uint8_t RESERVED1[3];
    __IO uint8_t  CR2;
    uint8_t RESERVED2[3];
    __IO uint8_t  CR3;
    uint8_t RESERVED3[3];
    __IO uint8_t  SEC;
    uint8_t RESERVED4[3];
    __IO uint8_t  MIN;
    uint8_t RESERVED5[3];
    __IO uint8_t  HOUR;
    uint8_t RESERVED6[3];
    __IO uint8_t  WEEK;
    uint8_t RESERVED7[3];
    __IO uint8_t  DAY;
    uint8_t RESERVED8[3];
    __IO uint8_t  MON;
    uint8_t RESERVED9[3];
    __IO uint8_t  YEAR;
    uint8_t RESERVED10[3];
    __IO uint8_t  ALMMIN;
    uint8_t RESERVED11[3];
    __IO uint8_t  ALMHOUR;
    uint8_t RESERVED12[3];
    __IO uint8_t  ALMWEEK;
    uint8_t RESERVED13[3];
    __IO uint8_t  ERRCRH;
    uint8_t RESERVED14[3];
    __IO uint8_t  ERRCRL;
} CM_RTC_TypeDef;

/**
 * @brief SPI
 */
typedef struct {
    __IO uint32_t DR;
    __IO uint32_t CR;
    uint8_t RESERVED0[4];
    __IO uint32_t CFG1;
    uint8_t RESERVED1[4];
    __IO uint32_t SR;
    __IO uint32_t CFG2;
} CM_SPI_TypeDef;

/**
 * @brief SRAMC
 */
typedef struct {
    uint8_t RESERVED0[8];
    __IO uint32_t CKCR;
    __IO uint32_t CKPR;
    __IO uint32_t CKSR;
    __IO uint32_t SRAM0_EIEN;
    __IO uint32_t SRAM0_EIBIT0;
    __IO uint32_t SRAM0_EIBIT1;
    __I  uint32_t SRAM0_ECCERRADDR;
    uint8_t RESERVED1[48];
    __IO uint32_t SRAMH_EIEN;
    __IO uint32_t SRAMH_EIBIT0;
    __IO uint32_t SRAMH_EIBIT1;
    __I  uint32_t SRAMH_ECCERRADDR;
    __IO uint32_t SRAMB_EIEN;
    __IO uint32_t SRAMB_EIBIT0;
    __IO uint32_t SRAMB_EIBIT1;
    __I  uint32_t SRAMB_ECCERRADDR;
} CM_SRAMC_TypeDef;

/**
 * @brief SWDT
 */
typedef struct {
    __IO uint32_t CR;
    __IO uint32_t SR;
    __IO uint32_t RR;
} CM_SWDT_TypeDef;

/**
 * @brief TMR0
 */
typedef struct {
    __IO uint32_t CNTAR;
    __IO uint32_t CNTBR;
    __IO uint32_t CMPAR;
    __IO uint32_t CMPBR;
    __IO uint32_t BCONR;
    __IO uint32_t STFLR;
} CM_TMR0_TypeDef;

/**
 * @brief TMR4
 */
typedef struct {
    __IO uint16_t OCCRUH;
    uint8_t RESERVED0[2];
    __IO uint16_t OCCRUL;
    uint8_t RESERVED1[2];
    __IO uint16_t OCCRVH;
    uint8_t RESERVED2[2];
    __IO uint16_t OCCRVL;
    uint8_t RESERVED3[2];
    __IO uint16_t OCCRWH;
    uint8_t RESERVED4[2];
    __IO uint16_t OCCRWL;
    uint8_t RESERVED5[2];
    __IO uint16_t OCCRXH;
    uint8_t RESERVED6[2];
    __IO uint16_t OCCRXL;
    uint8_t RESERVED7[2];
    __IO uint16_t OCSRU;
    __IO uint16_t OCERU;
    __IO uint16_t OCSRV;
    __IO uint16_t OCERV;
    __IO uint16_t OCSRW;
    __IO uint16_t OCERW;
    __IO uint16_t OCSRX;
    __IO uint16_t OCERX;
    __IO uint16_t OCMRUH;
    uint8_t RESERVED8[2];
    __IO uint32_t OCMRUL;
    __IO uint16_t OCMRVH;
    uint8_t RESERVED9[2];
    __IO uint32_t OCMRVL;
    __IO uint16_t OCMRWH;
    uint8_t RESERVED10[2];
    __IO uint32_t OCMRWL;
    __IO uint16_t OCMRXH;
    uint8_t RESERVED11[2];
    __IO uint32_t OCMRXL;
    __IO uint16_t CPSR;
    uint8_t RESERVED12[2];
    __IO uint16_t CNTR;
    uint8_t RESERVED13[2];
    __IO uint16_t CCSR;
    __IO uint16_t CVPR;
    __IO uint32_t PSCR;
    uint8_t RESERVED14[34];
    __IO uint16_t PFSRU;
    __IO uint16_t PDARU;
    __IO uint16_t PDBRU;
    uint8_t RESERVED15[2];
    __IO uint16_t PFSRV;
    __IO uint16_t PDARV;
    __IO uint16_t PDBRV;
    uint8_t RESERVED16[2];
    __IO uint16_t PFSRW;
    __IO uint16_t PDARW;
    __IO uint16_t PDBRW;
    uint8_t RESERVED17[2];
    __IO uint16_t PFSRX;
    __IO uint16_t PDARX;
    __IO uint16_t PDBRX;
    __IO uint16_t POCRU;
    uint8_t RESERVED18[2];
    __IO uint16_t POCRV;
    uint8_t RESERVED19[2];
    __IO uint16_t POCRW;
    uint8_t RESERVED20[2];
    __IO uint16_t POCRX;
    uint8_t RESERVED21[2];
    __IO uint16_t SCCRUH;
    uint8_t RESERVED22[2];
    __IO uint16_t SCCRUL;
    uint8_t RESERVED23[2];
    __IO uint16_t SCCRVH;
    uint8_t RESERVED24[2];
    __IO uint16_t SCCRVL;
    uint8_t RESERVED25[2];
    __IO uint16_t SCCRWH;
    uint8_t RESERVED26[2];
    __IO uint16_t SCCRWL;
    uint8_t RESERVED27[2];
    __IO uint16_t SCCRXH;
    uint8_t RESERVED28[2];
    __IO uint16_t SCCRXL;
    uint8_t RESERVED29[2];
    __IO uint16_t SCSRUH;
    __IO uint16_t SCMRUH;
    __IO uint16_t SCSRUL;
    __IO uint16_t SCMRUL;
    __IO uint16_t SCSRVH;
    __IO uint16_t SCMRVH;
    __IO uint16_t SCSRVL;
    __IO uint16_t SCMRVL;
    __IO uint16_t SCSRWH;
    __IO uint16_t SCMRWH;
    __IO uint16_t SCSRWL;
    __IO uint16_t SCMRWL;
    __IO uint16_t SCSRXH;
    __IO uint16_t SCMRXH;
    __IO uint16_t SCSRXL;
    __IO uint16_t SCMRXL;
    __IO uint16_t SCER;
    uint8_t RESERVED30[2];
    __IO uint32_t RCSR;
    __IO uint16_t SCIR;
    uint8_t RESERVED31[2];
    __IO uint16_t SCFR;
} CM_TMR4_TypeDef;

/**
 * @brief TMR6
 */
typedef struct {
    __IO uint32_t CNTER;
    __IO uint32_t UPDAR;
    uint8_t RESERVED0[56];
    __IO uint32_t PERAR;
    __IO uint32_t PERBR;
    __IO uint32_t PERCR;
    uint8_t RESERVED1[52];
    __IO uint32_t GCMAR;
    __IO uint32_t GCMBR;
    __IO uint32_t GCMCR;
    __IO uint32_t GCMDR;
    __IO uint32_t GCMER;
    __IO uint32_t GCMFR;
    uint8_t RESERVED2[40];
    __IO uint32_t SCMAR;
    __IO uint32_t SCMBR;
    __IO uint32_t SCMCR;
    __IO uint32_t SCMDR;
    __IO uint32_t SCMER;
    __IO uint32_t SCMFR;
    uint8_t RESERVED3[40];
    __IO uint32_t DTUAR;
    __IO uint32_t DTDAR;
    __IO uint32_t DTUBR;
    __IO uint32_t DTDBR;
    uint8_t RESERVED4[48];
    __IO uint32_t GCONR;
    __IO uint32_t ICONR;
    __IO uint32_t BCONR;
    __IO uint32_t DCONR;
    uint8_t RESERVED5[4];
    __IO uint32_t PCNAR;
    __IO uint32_t PCNBR;
    __IO uint32_t FCNGR;
    __IO uint32_t VPERR;
    __IO uint32_t STFLR;
    uint8_t RESERVED6[24];
    __IO uint32_t HSTAR;
    __IO uint32_t HSTPR;
    __IO uint32_t HCLRR;
    __IO uint32_t HUPDR;
    __IO uint32_t HCPAR;
    __IO uint32_t HCPBR;
    __IO uint32_t HCUPR;
    __IO uint32_t HCDOR;
} CM_TMR6_TypeDef;

/**
 * @brief TMR6_COMMON
 */
typedef struct {
    uint8_t RESERVED0[236];
    __IO uint32_t FCNTR;
    __IO uint32_t SSTAR;
    __IO uint32_t SSTPR;
    __IO uint32_t SCLRR;
    __IO uint32_t SUPDR;
} CM_TMR6_COMMON_TypeDef;

/**
 * @brief TMRA
 */
typedef struct {
    __IO uint32_t CNTER;
    __IO uint32_t PERAR;
    uint8_t RESERVED0[56];
    __IO uint32_t CMPAR1;
    __IO uint32_t CMPAR2;
    __IO uint32_t CMPAR3;
    __IO uint32_t CMPAR4;
    uint8_t RESERVED1[48];
    __IO uint8_t  BCSTRL;
    __IO uint8_t  BCSTRH;
    uint8_t RESERVED2[2];
    __IO uint16_t HCONR;
    uint8_t RESERVED3[2];
    __IO uint16_t HCUPR;
    uint8_t RESERVED4[2];
    __IO uint16_t HCDOR;
    uint8_t RESERVED5[2];
    __IO uint16_t ICONR;
    uint8_t RESERVED6[2];
    __IO uint16_t ECONR;
    uint8_t RESERVED7[2];
    __IO uint16_t FCONR;
    uint8_t RESERVED8[2];
    __IO uint16_t STFLR;
    uint8_t RESERVED9[34];
    __IO uint16_t BCONR1;
    uint8_t RESERVED10[6];
    __IO uint16_t BCONR2;
    uint8_t RESERVED11[54];
    __IO uint16_t CCONR1;
    uint8_t RESERVED12[2];
    __IO uint16_t CCONR2;
    uint8_t RESERVED13[2];
    __IO uint16_t CCONR3;
    uint8_t RESERVED14[2];
    __IO uint16_t CCONR4;
    uint8_t RESERVED15[50];
    __IO uint16_t PCONR1;
    uint8_t RESERVED16[2];
    __IO uint16_t PCONR2;
    uint8_t RESERVED17[2];
    __IO uint16_t PCONR3;
    uint8_t RESERVED18[2];
    __IO uint16_t PCONR4;
} CM_TMRA_TypeDef;

/**
 * @brief USART
 */
typedef struct {
    __I  uint32_t SR;
    __IO uint16_t TDR;
    __IO uint16_t RDR;
    __IO uint32_t BRR;
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __IO uint32_t CR3;
    __IO uint32_t PR;
    __I  uint32_t LBMC;
} CM_USART_TypeDef;

/**
 * @brief WDT
 */
typedef struct {
    __IO uint32_t CR;
    __IO uint32_t SR;
    __IO uint32_t RR;
} CM_WDT_TypeDef;

/******************************************************************************/
/*                     Memory Base Address                                    */
/******************************************************************************/
#define EFM_BASE                             (0x00000000UL)   /*!< EFM base address in the alias region */
#define SRAM_BASE                            (0x1FFFC000UL)   /*!< SRAM base address in the alias region */

/******************************************************************************/
/*           Device Specific Peripheral Base Address                          */
/******************************************************************************/
#define CM_ADC1_BASE                         (0x40040000UL)
#define CM_ADC2_BASE                         (0x40040400UL)
#define CM_ADC3_BASE                         (0x40040800UL)
#define CM_AOS_BASE                          (0x40010800UL)
#define CM_CMP1_BASE                         (0x40038400UL)
#define CM_CMP2_BASE                         (0x40038500UL)
#define CM_CMP3_BASE                         (0x4003B000UL)
#define CM_CMU_BASE                          (0x40048000UL)
#define CM_CRC_BASE                          (0x40008C00UL)
#define CM_CTC_BASE                          (0x40049C00UL)
#define CM_DAC1_BASE                         (0x40041000UL)
#define CM_DAC2_BASE                         (0x40041400UL)
#define CM_DBGC_BASE                         (0xE0042000UL)
#define CM_DMA_BASE                          (0x40053000UL)
#define CM_EFM_BASE                          (0x40010400UL)
#define CM_EMB0_BASE                         (0x40038600UL)
#define CM_EMB1_BASE                         (0x40038620UL)
#define CM_EMB2_BASE                         (0x40038640UL)
#define CM_EMB3_BASE                         (0x40038660UL)
#define CM_EMB4_BASE                         (0x40038680UL)
#define CM_EMB5_BASE                         (0x400386A0UL)
#define CM_EMB6_BASE                         (0x400386C0UL)
#define CM_EMB7_BASE                         (0x400386E0UL)
#define CM_EMB8_BASE                         (0x40038700UL)
#define CM_FCM_BASE                          (0x40048400UL)
#define CM_GPIO_BASE                         (0x40053800UL)
#define CM_HRPWM1_BASE                       (0x4003C000UL)
#define CM_HRPWM2_BASE                       (0x4003C400UL)
#define CM_HRPWM3_BASE                       (0x4003C800UL)
#define CM_HRPWM4_BASE                       (0x4003CC00UL)
#define CM_HRPWM5_BASE                       (0x4003D000UL)
#define CM_HRPWM6_BASE                       (0x4003D400UL)
#define CM_HRPWM_COMMON_BASE                 (0x4003C2F0UL)
#define CM_I2C_BASE                          (0x4003B400UL)
#define CM_ICG_BASE                          (0x00000400UL)
#define CM_INTC_BASE                         (0x40051000UL)
#define CM_MCAN1_BASE                        (0x40071000UL)
#define CM_MCAN2_BASE                        (0x40071400UL)
#define CM_MCANRAM_BASE                      (0x40073800UL)
#define CM_MPU_BASE                          (0x40050000UL)
#define CM_PERIC_BASE                        (0x40055400UL)
#define CM_PLA_BASE                          (0x4004FC00UL)
#define CM_PWC_BASE                          (0x40048000UL)
#define CM_RMU_BASE                          (0x4004CCE0UL)
#define CM_RTC_BASE                          (0x4004C000UL)
#define CM_SPI_BASE                          (0x4001C000UL)
#define CM_SRAMC_BASE                        (0x40050800UL)
#define CM_SWDT_BASE                         (0x40049400UL)
#define CM_TMR0_1_BASE                       (0x40024000UL)
#define CM_TMR0_2_BASE                       (0x40024400UL)
#define CM_TMR4_BASE                         (0x40038000UL)
#define CM_TMR6_1_BASE                       (0x40039000UL)
#define CM_TMR6_2_BASE                       (0x40039400UL)
#define CM_TMR6_3_BASE                       (0x40039800UL)
#define CM_TMR6_4_BASE                       (0x40039C00UL)
#define CM_TMR6_COMMON_BASE                  (0x40039300UL)
#define CM_TMRA_1_BASE                       (0x4003A000UL)
#define CM_TMRA_2_BASE                       (0x4003A400UL)
#define CM_TMRA_3_BASE                       (0x4003A800UL)
#define CM_TMRA_4_BASE                       (0x4003AC00UL)
#define CM_TMRA_5_BASE                       (0x40026000UL)
#define CM_USART1_BASE                       (0x4001CC00UL)
#define CM_USART2_BASE                       (0x4001D000UL)
#define CM_USART3_BASE                       (0x4001D400UL)
#define CM_USART4_BASE                       (0x4001D800UL)
#define CM_WDT_BASE                          (0x40049000UL)

/******************************************************************************/
/*           Device Specific Peripheral declaration & memory map              */
/******************************************************************************/
#define CM_ADC1                              ((CM_ADC_TypeDef *)CM_ADC1_BASE)
#define CM_ADC2                              ((CM_ADC_TypeDef *)CM_ADC2_BASE)
#define CM_ADC3                              ((CM_ADC_TypeDef *)CM_ADC3_BASE)
#define CM_AOS                               ((CM_AOS_TypeDef *)CM_AOS_BASE)
#define CM_CMP1                              ((CM_CMP_TypeDef *)CM_CMP1_BASE)
#define CM_CMP2                              ((CM_CMP_TypeDef *)CM_CMP2_BASE)
#define CM_CMP3                              ((CM_CMP_TypeDef *)CM_CMP3_BASE)
#define CM_CMU                               ((CM_CMU_TypeDef *)CM_CMU_BASE)
#define CM_CRC                               ((CM_CRC_TypeDef *)CM_CRC_BASE)
#define CM_CTC                               ((CM_CTC_TypeDef *)CM_CTC_BASE)
#define CM_DAC1                              ((CM_DAC_TypeDef *)CM_DAC1_BASE)
#define CM_DAC2                              ((CM_DAC_TypeDef *)CM_DAC2_BASE)
#define CM_DBGC                              ((CM_DBGC_TypeDef *)CM_DBGC_BASE)
#define CM_DMA                               ((CM_DMA_TypeDef *)CM_DMA_BASE)
#define CM_EFM                               ((CM_EFM_TypeDef *)CM_EFM_BASE)
#define CM_EMB0                              ((CM_EMB_TypeDef *)CM_EMB0_BASE)
#define CM_EMB1                              ((CM_EMB_TypeDef *)CM_EMB1_BASE)
#define CM_EMB2                              ((CM_EMB_TypeDef *)CM_EMB2_BASE)
#define CM_EMB3                              ((CM_EMB_TypeDef *)CM_EMB3_BASE)
#define CM_EMB4                              ((CM_EMB_TypeDef *)CM_EMB4_BASE)
#define CM_EMB5                              ((CM_EMB_TypeDef *)CM_EMB5_BASE)
#define CM_EMB6                              ((CM_EMB_TypeDef *)CM_EMB6_BASE)
#define CM_EMB7                              ((CM_EMB_TypeDef *)CM_EMB7_BASE)
#define CM_EMB8                              ((CM_EMB_TypeDef *)CM_EMB8_BASE)
#define CM_FCM                               ((CM_FCM_TypeDef *)CM_FCM_BASE)
#define CM_GPIO                              ((CM_GPIO_TypeDef *)CM_GPIO_BASE)
#define CM_HRPWM1                            ((CM_HRPWM_TypeDef *)CM_HRPWM1_BASE)
#define CM_HRPWM2                            ((CM_HRPWM_TypeDef *)CM_HRPWM2_BASE)
#define CM_HRPWM3                            ((CM_HRPWM_TypeDef *)CM_HRPWM3_BASE)
#define CM_HRPWM4                            ((CM_HRPWM_TypeDef *)CM_HRPWM4_BASE)
#define CM_HRPWM5                            ((CM_HRPWM_TypeDef *)CM_HRPWM5_BASE)
#define CM_HRPWM6                            ((CM_HRPWM_TypeDef *)CM_HRPWM6_BASE)
#define CM_HRPWM_COMMON                      ((CM_HRPWM_COMMON_TypeDef *)CM_HRPWM_COMMON_BASE)
#define CM_I2C                               ((CM_I2C_TypeDef *)CM_I2C_BASE)
#define CM_ICG                               ((CM_ICG_TypeDef *)CM_ICG_BASE)
#define CM_INTC                              ((CM_INTC_TypeDef *)CM_INTC_BASE)
#define CM_MCAN1                             ((CM_MCAN_TypeDef *)CM_MCAN1_BASE)
#define CM_MCAN2                             ((CM_MCAN_TypeDef *)CM_MCAN2_BASE)
#define CM_MCANRAM                           ((CM_MCANRAM_TypeDef *)CM_MCANRAM_BASE)
#define CM_MPU                               ((CM_MPU_TypeDef *)CM_MPU_BASE)
#define CM_PERIC                             ((CM_PERIC_TypeDef *)CM_PERIC_BASE)
#define CM_PLA                               ((CM_PLA_TypeDef *)CM_PLA_BASE)
#define CM_PWC                               ((CM_PWC_TypeDef *)CM_PWC_BASE)
#define CM_RMU                               ((CM_RMU_TypeDef *)CM_RMU_BASE)
#define CM_RTC                               ((CM_RTC_TypeDef *)CM_RTC_BASE)
#define CM_SPI                               ((CM_SPI_TypeDef *)CM_SPI_BASE)
#define CM_SRAMC                             ((CM_SRAMC_TypeDef *)CM_SRAMC_BASE)
#define CM_SWDT                              ((CM_SWDT_TypeDef *)CM_SWDT_BASE)
#define CM_TMR0_1                            ((CM_TMR0_TypeDef *)CM_TMR0_1_BASE)
#define CM_TMR0_2                            ((CM_TMR0_TypeDef *)CM_TMR0_2_BASE)
#define CM_TMR4                              ((CM_TMR4_TypeDef *)CM_TMR4_BASE)
#define CM_TMR6_1                            ((CM_TMR6_TypeDef *)CM_TMR6_1_BASE)
#define CM_TMR6_2                            ((CM_TMR6_TypeDef *)CM_TMR6_2_BASE)
#define CM_TMR6_3                            ((CM_TMR6_TypeDef *)CM_TMR6_3_BASE)
#define CM_TMR6_4                            ((CM_TMR6_TypeDef *)CM_TMR6_4_BASE)
#define CM_TMR6_COMMON                       ((CM_TMR6_COMMON_TypeDef *)CM_TMR6_COMMON_BASE)
#define CM_TMRA_1                            ((CM_TMRA_TypeDef *)CM_TMRA_1_BASE)
#define CM_TMRA_2                            ((CM_TMRA_TypeDef *)CM_TMRA_2_BASE)
#define CM_TMRA_3                            ((CM_TMRA_TypeDef *)CM_TMRA_3_BASE)
#define CM_TMRA_4                            ((CM_TMRA_TypeDef *)CM_TMRA_4_BASE)
#define CM_TMRA_5                            ((CM_TMRA_TypeDef *)CM_TMRA_5_BASE)
#define CM_USART1                            ((CM_USART_TypeDef *)CM_USART1_BASE)
#define CM_USART2                            ((CM_USART_TypeDef *)CM_USART2_BASE)
#define CM_USART3                            ((CM_USART_TypeDef *)CM_USART3_BASE)
#define CM_USART4                            ((CM_USART_TypeDef *)CM_USART4_BASE)
#define CM_WDT                               ((CM_WDT_TypeDef *)CM_WDT_BASE)

/******************************************************************************/
/*                   Peripheral Registers Bits Definition                     */
/******************************************************************************/

